SM_для_EDT/src/InformationRegisters/впИнтеграцияДокументов/впИнтеграцияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>впИнтеграцияДокументов</name>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументТОИР</name>
    <type>
      <types>DocumentRef.впЗаявкаНаРемонт</types>
      <types>DocumentRef.впПланГрафикРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументЕРП</name>
    <type>
      <types>DocumentRef.впЗаявкаНаСнабжение</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SM_для_EDT/src/AccumulationRegisters/рарусИмуществоНаСудах/рарусИмуществоНаСудах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>рарусИмуществоНаСудах</name>
  <comment>rarus makole</comment>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодСинхронизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Распоряжение</name>
    <type>
      <types>DefinedType.рарусРаспоряжение</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>EnumRef.рарусСтатусыИмуществаНаСудне</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

SM_для_EDT/src/Enums/рарусСтатусыСогласованияЗаявкиНаСнабжение/рарусСтатусыСогласованияЗаявкиНаСнабжение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рарусСтатусыСогласованияЗаявкиНаСнабжение</name>
  <enumValues>
    <name>СогласованиеКапитаном</name>
  </enumValues>
  <enumValues>
    <name>ДоработкаИнициатором</name>
  </enumValues>
  <enumValues>
    <name>Согласована</name>
  </enumValues>
  <enumValues>
    <name>ДоработкаКапитаном</name>
  </enumValues>
  <enumValues>
    <name>СозданаНаБерегу</name>
  </enumValues>
</mdclass:Enum>

SM_для_EDT/src/Enums/рарусОбластиРедактирования/рарусОбластиРедактирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рарусОбластиРедактирования</name>
  <comment>rarus PleA ФТ.СНБ.01.01</comment>
  <enumValues>
    <name>Судно</name>
  </enumValues>
  <enumValues>
    <name>Берег</name>
  </enumValues>
</mdclass:Enum>

SM_для_EDT/src/Enums/рарусВидыПотребностиЗаявкиНаСнабжение/рарусВидыПотребностиЗаявкиНаСнабжение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рарусВидыПотребностиЗаявкиНаСнабжение</name>
  <comment>rarus PleA ФТ.СНБ.01.01</comment>
  <enumValues>
    <name>ТМЦ</name>
  </enumValues>
  <enumValues>
    <name>Услуги</name>
  </enumValues>
  <enumValues>
    <name>ТМЦЗаСчетСобственныхСредств</name>
  </enumValues>
  <enumValues>
    <name>ПродуктыПитания</name>
  </enumValues>
  <enumValues>
    <name>НавигационныеКарты</name>
  </enumValues>
</mdclass:Enum>

SM_для_EDT/src/Documents/впПриходТМЦ/впПриходТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>впПриходТМЦ</name>
  <basedOn>Document.впЗаявкаНаСнабжение</basedOn>
  <basedOn>Document.рарусИнвентаризацияТМЦ</basedOn>
  <registerRecords>AccumulationRegister.впТоварыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.впТоварыКПоступлению</registerRecords>
  <registerRecords>AccumulationRegister.рарусИмуществоНаСудах</registerRecords>
  <registerRecords>AccumulationRegister.рарусТоварыЗаявокНаСнабжение</registerRecords>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.vftСуда</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Распоряжение</name>
    <type>
      <types>DocumentRef.впЗаказПоставщику</types>
      <types>DocumentRef.впПеремещениеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СформированСМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.рарусВидыОперацийПриходаТМЦ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.рарусИнвентаризацияТМЦ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОприходованиеБывшегоВУпотреблении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолученВБМ</name>
    <comment>rarus atyutyakin ФТ.ИМ.02.01</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТМЦ</name>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.впЗаявкаНаСнабжение</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SM_для_EDT/src/Documents/впЗаявкаНаСнабжение/впЗаявкаНаСнабжение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>впЗаявкаНаСнабжение</name>
  <registerRecords>AccumulationRegister.рарусТоварыЗаявокНаСнабжение</registerRecords>
  <registerRecords>InformationRegister.впЗаявкиНаСнабжение</registerRecords>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.vftСуда</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>IDремонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПотребности</name>
    <type>
      <types>EnumRef.рарусВидыПотребностиЗаявкиНаСнабжение</types>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемаяДатаПоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбластьРедактирования</name>
    <type>
      <types>EnumRef.рарусОбластиРедактирования</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйКодСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСудовойЗаявки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСогласования</name>
    <type>
      <types>EnumRef.рарусСтатусыСогласованияЗаявкиНаСнабжение</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйБереговойСлужбы</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбластьСоздания</name>
    <type>
      <types>EnumRef.рарусОбластиРедактирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрацииСудовойЗаявки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>БереговаяСлужба</name>
    <comment>makole РАIT-0023340</comment>
    <type>
      <types>CatalogRef.рарусБереговыеСлужбы</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияЗаявки</name>
    <comment>makole РАIT-0023340</comment>
    <type>
      <types>EnumRef.рарусКатегорииЗаявокНаСнабжение</types>
    </type>
  </attributes>
  <attributes>
    <name>Заголовок</name>
    <comment>makole РАIT-0023340</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЖелаемаяДатаОтгрузки</name>
    <comment>makole РАIT-0023340</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсторияИзмененияВерсий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СогласованиеАналоговНеЗавершено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>МатериалыИРаботы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОтгрузки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОбеспечения</name>
      <type>
        <types>EnumRef.ВариантыОбеспечения</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.рарусСостоянияЗаявокНаСнабжение</types>
      </type>
    </attributes>
    <attributes>
      <name>Доработать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаДоработки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналог</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураПоставщика</name>
      <type>
        <types>CatalogRef.рарусНоменклатураПоставщиков</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторФайлов</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ВерсияСтроки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВерсияСтрокиЗаблокирована</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсходнаяНоменклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗапрашиваемаяНоменклатура</name>
      <comment>ФТ.АН.01.05</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакАналог</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаЗамены</name>
      <comment>ФТ.АН.01.05</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийСогласующего</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусСогласования</name>
      <type>
        <types>EnumRef.рарусСтатусыСогласованияАналогов</types>
      </type>
    </attributes>
    <attributes>
      <name>IDПервоначальный</name>
      <comment>ФТ.АН.01.05</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>IDДинамический</name>
      <comment>ФТ.АН.01.05</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.впЗаявкаНаРемонт</types>
        <types>DocumentRef.впПланГрафикРемонта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПрисоединенныеФайлыСтрок</name>
    <attributes>
      <name>ИдентификаторФайлов</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Файл</name>
      <type>
        <types>CatalogRef.впЗаявкаНаСнабжениеПрисоединенныеФайлы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SM_для_EDT/src/CommonModules/рарусЗаявкаНаСнабжениеСервер/Module.bsl
#Область Проведение

// Формирует параметры для проведения документа по регистрам учетного механизма через общий механизм проведения.
//
// Параметры:
//  Документ - ДокументОбъект - записываемый документ
//  Свойства - ФиксированнаяСтруктура - свойства документа (См. ПроведениеДокументов.СвойстваДокумента).
//
// Возвращаемое значение:
//  Структура - параметры учетного механизма (См. ПроведениеДокументов.ПараметрыУчетногоМеханизма()).
//
Функция ПараметрыДляПроведенияДокумента(Документ, Свойства) Экспорт
	
	Параметры = ПроведениеДокументов.ПараметрыУчетногоМеханизма();
	
	// Проведение
	Если Свойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Параметры.ПодчиненныеРегистры.Добавить(Метаданные.РегистрыСведений.впЗаявкиНаСнабжение);
		
		Параметры.НезависимыеРегистры.Добавить(Метаданные.РегистрыСведений.впИнтеграцияДокументов);
		
	КонецЕсли;
	
	// Контроль
	Если Свойства.РежимЗаписи <> РежимЗаписиДокумента.Запись Тогда
		
		Параметры.КонтрольныеРегистрыЗаданий.Добавить(Метаданные.РегистрыСведений.впЗаявкиНаСнабжение);
		
	КонецЕсли;
		
	Возврат Параметры;
	
КонецФункции

// Процедура формирования движений по подчиненным регистрам
//
// Параметры:
//   ТаблицыДляДвижений - Структура - таблицы данных документа
//   Движения - КоллекцияДвижений - коллекция наборов записей движений документа
//   Отказ - Булево - признак отказа от проведения документа.
//
Процедура ОтразитьДвижения(ТаблицыДляДвижений, Движения, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеДокументов.ОтразитьДвижения(ТаблицыДляДвижений, Движения, "впЗаявкиНаСнабжение");
	
КонецПроцедуры

// Процедура формирования движений по независимым регистрам
//
// Параметры:
//	ТаблицыДляДвижений - Структура - таблицы данных документа
//	Документ - ДокументСсылка - ссылка на документ
//	Отказ - Булево - признак отказа от проведения документа.
//
Процедура ЗаписатьДанные(ТаблицыДляДвижений, Документ, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ТаблицыДляДвижений.Свойство("ТаблицавпИнтеграцияДокументов") Тогда
		
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.впИнтеграцияДокументов");	
		ЭлементБлокировкиДанных.УстановитьЗначение("ДокументЕРП", Документ);
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		
		НаборЗаписей = РегистрыСведений.впИнтеграцияДокументов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДокументЕРП.Установить(Документ);		
		НаборЗаписей.Загрузить(ТаблицыДляДвижений.ТаблицавпИнтеграцияДокументов);
		НаборЗаписей.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

#Область ФормированиеПриходаТМЦ

// ++ rarus makole 2021-03-16
//Процедура СформироватьПриходТМЦИпровести(Заявка, Отказ) Экспорт
Процедура СформироватьПриходТМЦИпровести(Заявка, Отказ, ДополнительныеСвойства) Экспорт
	
	Перем НомерВходящегоДокумента;
	// -- rarus makole 2021-03-16

	Приход = Документы.впПриходТМЦ.СоздатьДокумент();
	Приход.Заполнить(Заявка);
	// ++ rarus makole 2021-03-16
	Если ТипЗнч(ДополнительныеСвойства) = Тип("Структура")
		И ДополнительныеСвойства.Свойство("НомерВходящегоДокумента", НомерВходящегоДокумента) Тогда
		Приход.НомерВходящегоДокумента = НомерВходящегоДокумента;
		Приход.ДатаВходящегоДокумента = ДополнительныеСвойства.ДатаВходящегоДокумента;
		Приход.Комментарий = ДополнительныеСвойства.Комментарий;
	КонецЕсли;
	// -- rarus makole 2021-03-16
	Приход.Записать(РежимЗаписиДокумента.Проведение);

КонецПроцедуры

Процедура ЗаполнитьПриходТМЦПоЗаявке(Приход, Заявка) Экспорт
	
	// ++ rarus atyutyakin 21.01.2021  [ФТ.ИМ.02.01]
	ЗаполнитьДаннымиПоИмуществу(Заявка, Приход);
	// -- rarus atyutyakin 21.01.2021
	
	ЗаполнитьПриходТМЦПоЗаявкеМатериалы(Приход, Заявка);
	
КонецПроцедуры

Процедура ЗаполнитьДаннымиПоИмуществу(Заявка, Знач Приход)		
	
	РеквизитыЗаявки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Заявка, "Дата, Подразделение, ВидПотребности");
	
	ПараметрыФО = Новый Структура("Период, Судно", РеквизитыЗаявки.Дата, РеквизитыЗаявки.Подразделение);
	ИмущественныйУчетВключен = ПолучитьФункциональнуюОпцию("рарусИспользоватьИмущественныйУчет", ПараметрыФО);
	
	ВидОперации = Неопределено;
	Если РеквизитыЗаявки.ВидПотребности = ВидПотребностиТМЦЗаСчетСобственныхСредств() Тогда
		ВидОперации = рарусПриходТМЦ.ВидОперацииЗакупкаЧерезПодотчетноеЛицо();
	ИначеЕсли ИмущественныйУчетВключен И РеквизитыЗаявки.ВидПотребности = ВидПотребностиПродуктыПитания() Тогда
		ВидОперации = рарусПриходТМЦ.ВидОперацииЗакупкаПродуктовПитания();
	ИначеЕсли ИмущественныйУчетВключен И РеквизитыЗаявки.ВидПотребности = ВидПотребностиНавигационныеКарты() Тогда
		ВидОперации = рарусПриходТМЦ.ВидОперацииЗакупкаНавигационныхКарт();
	КонецЕсли;
	
	Приход.Подразделение = РеквизитыЗаявки.Подразделение;
	Приход.ВидОперации = ВидОперации;
	
	//Приход.Подразделение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Заявка, "Подразделение");
	//Приход.ВидОперации = Перечисления.рарусВидыОперацийПриходаТМЦ.ЗакупкаЧерезПодотчетноеЛицо;

КонецПроцедуры

Процедура ЗаполнитьПриходТМЦПоЗаявкеМатериалы(Приход, Заявка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	// ++ rarus atyutyakin 19.02.2021  [ФТ.ИМ.02.01]
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	впЗаявкаНаСнабжениеМатериалыИРаботы.Номенклатура КАК Номенклатура,
	|	впЗаявкаНаСнабжениеМатериалыИРаботы.Количество КАК Количество,
	|	впЗаявкаНаСнабжениеМатериалыИРаботы.Ссылка КАК Заявка,
	|	впЗаявкаНаСнабжениеМатериалыИРаботы.КодСтроки КАК КодСтроки
	|ПОМЕСТИТЬ ВТНоменклатураЗаявки
	|ИЗ
	|	Документ.впЗаявкаНаСнабжение.МатериалыИРаботы КАК впЗаявкаНаСнабжениеМатериалыИРаботы
	|ГДЕ
	|	впЗаявкаНаСнабжениеМатериалыИРаботы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	впПриходТМЦТМЦ.Номенклатура КАК Номенклатура,
	|	впПриходТМЦТМЦ.Количество КАК Количество,
	|	впПриходТМЦТМЦ.Заявка КАК Заявка,
	|	впПриходТМЦТМЦ.КодСтроки КАК КодСтроки,
	|	впПриходТМЦТМЦ.Ссылка КАК ПриходТМЦ
	|ПОМЕСТИТЬ ВТУжеВведенныеПриходыПоЗаявке
	|ИЗ
	|	Документ.впПриходТМЦ.ТМЦ КАК впПриходТМЦТМЦ
	|ГДЕ
	|	впПриходТМЦТМЦ.Ссылка.Проведен
	|	И впПриходТМЦТМЦ.Заявка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	рарусИмуществоНаСудах.Регистратор КАК ПриходТМЦ
	|ПОМЕСТИТЬ ВТПриходыТМЦСДвижениямиПоИмуществу
	|ИЗ
	|	РегистрНакопления.рарусИмуществоНаСудах КАК рарусИмуществоНаСудах
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТУжеВведенныеПриходыПоЗаявке КАК УжеВведенныеПриходыПоЗаявке
	|		ПО рарусИмуществоНаСудах.Регистратор = УжеВведенныеПриходыПоЗаявке.ПриходТМЦ
	|ГДЕ
	|	рарусИмуществоНаСудах.Активность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаявкаБезУжеВведенныхПриходов.Номенклатура КАК Номенклатура,
	|	СУММА(ЗаявкаБезУжеВведенныхПриходов.Количество) КАК Количество,
	|	ЗаявкаБезУжеВведенныхПриходов.Заявка КАК Заявка,
	|	ЗаявкаБезУжеВведенныхПриходов.КодСтроки КАК КодСтроки
	|ИЗ
	|	(ВЫБРАТЬ
	|		НоменклатураЗаявки.Номенклатура КАК Номенклатура,
	|		НоменклатураЗаявки.Количество КАК Количество,
	|		НоменклатураЗаявки.Заявка КАК Заявка,
	|		НоменклатураЗаявки.КодСтроки КАК КодСтроки
	|	ИЗ
	|		ВТНоменклатураЗаявки КАК НоменклатураЗаявки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		УжеВведенныеПриходыПоЗаявке.Номенклатура,
	|		-УжеВведенныеПриходыПоЗаявке.Количество,
	|		УжеВведенныеПриходыПоЗаявке.Заявка,
	|		УжеВведенныеПриходыПоЗаявке.КодСтроки
	|	ИЗ
	|		ВТУжеВведенныеПриходыПоЗаявке КАК УжеВведенныеПриходыПоЗаявке
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПриходыТМЦСДвижениямиПоИмуществу КАК ПриходыТМЦСДвижениямиПоИмуществу
	|			ПО УжеВведенныеПриходыПоЗаявке.ПриходТМЦ = ПриходыТМЦСДвижениямиПоИмуществу.ПриходТМЦ) КАК ЗаявкаБезУжеВведенныхПриходов
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаявкаБезУжеВведенныхПриходов.Номенклатура,
	|	ЗаявкаБезУжеВведенныхПриходов.Заявка,
	|	ЗаявкаБезУжеВведенныхПриходов.КодСтроки
	|
	|ИМЕЮЩИЕ
	|	СУММА(ЗаявкаБезУжеВведенныхПриходов.Количество) > 0";
	
	//"ВЫБРАТЬ
	//|	впЗаявкаНаСнабжениеМатериалыИРаботы.Номенклатура КАК Номенклатура,
	//|	впЗаявкаНаСнабжениеМатериалыИРаботы.Количество КАК Количество,
	//|	впЗаявкаНаСнабжениеМатериалыИРаботы.Ссылка КАК Заявка,
	//|	впЗаявкаНаСнабжениеМатериалыИРаботы.КодСтроки КАК КодСтроки
	//|ИЗ
	//|	Документ.впЗаявкаНаСнабжение.МатериалыИРаботы КАК впЗаявкаНаСнабжениеМатериалыИРаботы
	//|ГДЕ
	//|	впЗаявкаНаСнабжениеМатериалыИРаботы.Ссылка = &Ссылка";
	// -- rarus atyutyakin 19.02.2021
	
	Запрос.УстановитьПараметр("Ссылка", Заявка);
	
	ДанныеТМЦ = Запрос.Выполнить().Выгрузить();
	
	Приход.ТМЦ.Загрузить(ДанныеТМЦ);

КонецПроцедуры

#КонецОбласти 
 
#КонецОбласти

Функция ОсновноеСудно() Экспорт
	
	ОсновноеСудно = vftОбщегоНазначения.ПолучитьЗначениеПоУмолчанию("ОсновноеСудно");
	
	Возврат ОсновноеСудно;
	
КонецФункции

Функция ОсновнаяОрганизация() Экспорт
	
	Возврат Константы.впОсновнаяОрганизация.Получить();
	
КонецФункции

Процедура УстановитьВозможностьИзменения(Форма, ТекущийОбъект) Экспорт
	
	Ссылка = ТекущийОбъект.Ссылка;
	
	ОбъектДоступенДляРедактирования = рарусСостоянияРедактированияОбъектов.ОбъектДоступенДляРедактирования(Ссылка);
	
	Форма.ТолькоПросмотр = Не ОбъектДоступенДляРедактирования;
	
Конецпроцедуры	

Процедура УстановитьВидимостьДоступностьЭлементовСогласования(Форма) Экспорт

	//TODO
	УстановитьВидимостьДоступностьРеквизитовСогласования(Форма);
	
	УстановитьВидимостьКнопокСогласования(Форма);

КонецПроцедуры

Процедура УстановитьВидимостьДоступностьРеквизитовСогласования(Форма)
	
	ЕстьПравоОтправкиНаБерег = рарусСостоянияРедактированияОбъектов.ЕстьПравоОтправкиНаБерег();
	
	Форма.Элементы.МатериальныеЗатратыДоработать.Доступность 		= ЕстьПравоОтправкиНаБерег;	
	Форма.Элементы.МатериальныеЗатратыПричинаДоработки.Доступность 	= ЕстьПравоОтправкиНаБерег;	
	Форма.Элементы.МатериальныеЗатратыОтменено.Доступность 			= ЕстьПравоОтправкиНаБерег;	
	
	ВидПотребностиТребуетСогласования = ВидПотребностиТребуетСогласования(Форма.Объект.ВидПотребности);
	
	Форма.Элементы.МатериальныеЗатратыДоработать.Видимость	= ВидПотребностиТребуетСогласования;
	Форма.Элементы.МатериальныеЗатратыПричинаДоработки.Видимость	= ВидПотребностиТребуетСогласования;
	Форма.Элементы.МатериальныеЗатратыОтменено.Видимость	= ВидПотребностиТребуетСогласования;
	
КонецПроцедуры	

Процедура УстановитьВидимостьКнопокСогласования(Форма)
		
	Форма.Элементы.ФормаОтправитьНаБерег.Видимость = ВидимостьКнопкиОтправкиНаБерег(Форма);
	
	Форма.Элементы.ОтправитьНаСогласованиеКапитану.Видимость = ВидимостьКнопкиОтправитьНаСогласованиеКапитану(Форма);	
	
	Форма.Элементы.ОтправитьНаДоработку.Видимость = ВидимостьКнопкиОтправитьНаДоработку(Форма);
	
	Форма.Элементы.ОприходоватьИЗакрыть.Видимость = ВидимостьКнопкиОприходоватьИЗакрыть(Форма);
			
КонецПроцедуры	

Процедура ЗаполнитьСостоянияСтрокЗаявки(Форма) Экспорт
	
	ЗаявкаНаСнабжениеСсылка = СсылкаНаДокументИзФормы(Форма);
	
	ТаблицаТекущихСостояний = рарусЗаявкаНаСнабжениеСтатусы.ПолучитьТекущиеСостоянияСтрокДокумента(ЗаявкаНаСнабжениеСсылка);
	
	ЗаполнитьСостоянияСтрокПоТаблицеСостояний(Форма, ТаблицаТекущихСостояний);
		
КонецПроцедуры

Процедура ЗаполнитьСостоянияСтрокПоТаблицеСостояний(Форма, ТаблицаТекущихСостояний)		
	
	Для Каждого СтрокаДокумента Из Форма.Объект.МатериалыИРаботы цикл
		
		СтрокаСостояния = ТаблицаТекущихСостояний.Найти(СтрокаДокумента.КодСтроки, "КодСтроки");
		
		Если СтрокаСостояния <> Неопределено тогда
			СтрокаДокумента.Состояние = СтрокаСостояния.СостояниеТекущее;
			СтрокаДокумента.СостояниеСтрокой = рарусЗаявкаНаСнабжениеСтатусы.ПолучитьПредставлениеСостояния(СтрокаДокумента.Состояние);			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

Функция ВидимостьКнопкиОтправкиНаБерег(Форма)
	
	Если Не ВидПотребностиТребуетСогласования(Форма.Объект.ВидПотребности) тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЕстьПравоОтправкиНаБерег = рарусСостоянияРедактированияОбъектов.ЕстьПравоОтправкиНаБерег();
	ОбъектДоступенДляРедактирования = рарусСостоянияРедактированияОбъектов.ОбъектДоступенДляРедактирования(Форма.Объект.Ссылка);
	
	Возврат ЕстьПравоОтправкиНаБерег И ОбъектДоступенДляРедактирования;	
	
КонецФункции

Функция ВидимостьКнопкиОтправитьНаСогласованиеКапитану(Форма)
	
	Если Не ВидПотребностиТребуетСогласования(Форма.Объект.ВидПотребности) тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЕстьПравоОтправкиНаБерег = рарусСостоянияРедактированияОбъектов.ЕстьПравоОтправкиНаБерег();
	ЭтоОбластьРедактированияНаСудне = Форма.Объект.ОбластьРедактирования = ОбластьРедактированияНаСудне();
	ЭтоСозданиеИлиДоработка = Форма.Объект.СтатусСогласования = СтатусСогласованияНаДоработку()
								ИЛИ Форма.Объект.СтатусСогласования = СтатусСогласованияНачальный();															

	Возврат НЕ ЕстьПравоОтправкиНаБерег 
		И ЭтоОбластьРедактированияНаСудне 
		И ЭтоСозданиеИлиДоработка;	
	
КонецФункции

Функция ВидимостьКнопкиОтправитьНаДоработку(Форма)
	
	Если Не ВидПотребностиТребуетСогласования(Форма.Объект.ВидПотребности) тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЕстьПравоОтправкиНаБерег = рарусСостоянияРедактированияОбъектов.ЕстьПравоОтправкиНаБерег();
	ЭтоОбластьРедактированияНаСудне = Форма.Объект.ОбластьРедактирования = ОбластьРедактированияНаСудне();
	ИнициаторСовпадаетСтекущимПользователем = ИнициаторСовпадаетСтекущимПользователем(Форма.Объект.Ответственный);
	// ++ rarus PleA 19.02.2021 [27259 ]
	ЭтоДоработкаКапитаном = Форма.Объект.СтатусСогласования = СтатусСогласованияНаДоработкуКапитаном();
	// -- rarus PleA

	Возврат ЕстьПравоОтправкиНаБерег 
		И ЭтоОбластьРедактированияНаСудне 
		И Не ИнициаторСовпадаетСтекущимПользователем
	// ++ rarus PleA 19.02.2021 [27259]	
		И Не ЭтоДоработкаКапитаном;	
	// -- rarus PleA
	
КонецФункции

Функция ВидимостьКнопкиОприходоватьИЗакрыть(Форма)
	
	// ++ rarus atyutyakin 29.01.2021  [ФТ.ИМ.02.01]
	КнопкаВидима = Форма.Объект.ВидПотребности = ВидПотребностиТМЦЗаСчетСобственныхСредств();
	
	ДатаДокумента = ?(ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Объект, "Дата"),
		Форма.Объект.Дата, ТекущаяДатаСеанса());
	СудноДокумента = ?(ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Объект, "Подразделение"),
		Форма.Объект.Подразделение, Неопределено);
	ПараметрыФО = Новый Структура("Период, Судно", ДатаДокумента, СудноДокумента);
	Если рарусИмущественныйУчетСервер.ИспользоватьИмущественныйУчет(ПараметрыФО) Тогда
		КнопкаВидима = (Форма.Объект.ВидПотребности = ВидПотребностиТМЦЗаСчетСобственныхСредств()
			ИЛИ Форма.Объект.ВидПотребности = ВидПотребностиПродуктыПитания()
			ИЛИ Форма.Объект.ВидПотребности = ВидПотребностиНавигационныеКарты());
	КонецЕсли; 
		
	Возврат КнопкаВидима;
	//Возврат Форма.Объект.ВидПотребности = ВидПотребностиТМЦЗаСчетСобственныхСредств();	
	// -- rarus atyutyakin 29.01.2021
	
КонецФункции

Функция ВидПотребностиТребуетСогласования(ВидПотребности)
	
	Возврат Видпотребности = ВидПотребностиТМЦ() ИЛИ Видпотребности = ВидПотребностиУслуги();

КонецФункции

Функция ИнициаторСовпадаетСтекущимПользователем(Ответственный)
	
	Возврат Ответственный = Пользователи.ТекущийПользователь();
	
КонецФункции	

Процедура ЗаполнитьПредставлениеСтатусаСогласования(Форма) Экспорт

	Объект = Форма.Объект;
	Форма.СтатусСогласованияСтрокой = ПолучитьПредставлениеСтатусаСогласованияПолное(Объект);	

КонецПроцедуры

Процедура УстановитьСтатусСогласованияПередЗаписью(ЗаявкаОбъект) Экспорт
	
	СтатусСогласованияУстановить  = Неопределено;

	Если ЭтоСменаСтатуса(ЗаявкаОбъект, СтатусСогласованияУстановить) тогда
		
		рарусОбщегоНазначенияСервер.ВызыватьИсключениеЕслиПустое(СтатусСогласованияУстановить);
		
		ЗаявкаОбъект.СтатусСогласования = СтатусСогласованияУстановить;
		
		ОчиститьДоработку(ЗаявкаОбъект, СтатусСогласованияУстановить);
		
		УстановитьОбластьРедактированияБерегЕслиСогласована(ЗаявкаОбъект);
		
	КонецЕсли;	
	
КонецПроцедуры	

Функция ЭтоСменаСтатуса(ЗаявкаОбъект, СтатусСогласованияУстановить) Экспорт
			
	Возврат ЗаявкаОбъект.ДополнительныеСвойства.Свойство("СтатусСогласованияУстановить", СтатусСогласованияУстановить) 	
	
КонецФункции	

Процедура ОчиститьДоработку(ЗаявкаОбъект, СтатусСогласования)
	
	Если СтатусСогласования = СтатусСогласованияНаСогласованииКапитаном() 
		ИЛИ СтатусСогласования = СтатусСогласованияСогласована() тогда
		
		Для Каждого СтрокаДоработки Из ЗаявкаОбъект.МатериалыИРаботы цикл
			
			СтрокаДоработки.Доработать = Ложь;	
			СтрокаДоработки.ПричинаДоработки = "";
			
		КонецЦикла;	
		
	КонецЕсли;	
	
КонецПроцедуры	

Функция СсылкаНаДокументИзФормы(Форма)
	
	Возврат Форма.Объект.Ссылка;

КонецФункции

Функция ПолучитьПредставлениеСтатусаСогласованияПолное(Объект)
	
	ПредставлениеСтатусаСогласования = ПолучитьПредставлениеСтатусаСогласования(Объект);
	
	Возврат СтрШаблон("%1", ПредставлениеСтатусаСогласования);
	
КонецФункции

Функция ПолучитьПредставлениеДоступностиРедактирования(Ссылка)		

	ОбъектДоступенДляРедактирования = Истина;
	
	Если ЗначениеЗаполнено(Ссылка) тогда
		ОбъектДоступенДляРедактирования = рарусСостоянияРедактированияОбъектов.ОбъектДоступенДляРедактирования(Ссылка);
	Иначе
		Возврат "";
	КонецЕсли;
	
	Если ОбъектДоступенДляРедактирования тогда
		
		Возврат ТекстДоступенДляРедактирования();
				
	КонецЕсли;	
	
	Возврат ТекстНеДоступенДляРедактирования();

КонецФункции

Функция ТекстНеДоступенДляРедактирования()
	
	Возврат "(не доступна для редактирования)";

КонецФункции

Функция ТекстДоступенДляРедактирования()
	
	Возврат "(доступна для редактирования)";

КонецФункции 
 
Процедура УстановитьОбластьРедактированияБерегЕслиСогласована(ЗаявкаОбъект)

	Если ЗаявкаОбъект.СтатусСогласования = СтатусСогласованияСогласована() тогда
		
		ЗаявкаОбъект.ОбластьРедактирования = ОбластьРедактированияНаБерегу();
		
	КонецЕсли;	

КонецПроцедуры
 
Функция ПолучитьПредставлениеСтатусаСогласования(Объект)
	
	СтатусСогласования = Объект.СтатусСогласования;
			
	Если СтатусСогласования = СтатусСогласованияНаДоработку() тогда
		Возврат ПредставлениеСтатусаСогласованияНаДоработке();
	КонецЕсли;
	
	Если СтатусСогласования = СтатусСогласованияНаСогласованииКапитаном() тогда
		Возврат ПредставлениеСтатусаСогласованияНаСогласованииКапитаном();
	КонецЕсли;
	
	Если СтатусСогласования = СтатусСогласованияСогласована() тогда
		Возврат ПредставлениеСтатусаСогласованияСогласована(Объект);			
	КонецЕсли;	
	
	Если СтатусСогласования = СтатусСогласованияНаДоработкуКапитаном() тогда
		Возврат ПредставлениеСтатусСогласованияНаДоработкуКапитаном();	
	КонецЕсли;
	
	Если СтатусСогласования = СтатусСогласованияСозданаНаБерегу() тогда
		Возврат ПредставлениеСтатусСогласованияСозданаНаБерегу();	
	КонецЕсли;
		
	возврат ПредставлениеСтатусаСогласованияЧерновик();	
	
КонецФункции

Функция СтатусСогласованияНачальный() Экспорт
	
	Возврат Перечисления.рарусСтатусыСогласованияЗаявкиНаСнабжение.ПустаяСсылка();

КонецФункции

Функция СтатусСогласованияНаДоработку() Экспорт
	
	Возврат Перечисления.рарусСтатусыСогласованияЗаявкиНаСнабжение.ДоработкаИнициатором;

КонецФункции

Функция СтатусСогласованияСогласована() Экспорт
	
	Возврат Перечисления.рарусСтатусыСогласованияЗаявкиНаСнабжение.Согласована;

КонецФункции

Функция СтатусСогласованияНаСогласованииКапитаном() Экспорт
	
	Возврат Перечисления.рарусСтатусыСогласованияЗаявкиНаСнабжение.СогласованиеКапитаном;

КонецФункции

Функция СтатусСогласованияНаДоработкуКапитаном() Экспорт
	
	Возврат Перечисления.рарусСтатусыСогласованияЗаявкиНаСнабжение.ДоработкаКапитаном;

КонецФункции

Функция СтатусСогласованияСозданаНаБерегу() Экспорт
	
	Возврат Перечисления.рарусСтатусыСогласованияЗаявкиНаСнабжение.СозданаНаБерегу;

КонецФункции

Функция СтатусСогласованияНаДоработкуВЗависимотстиОтРолиПользователя() Экспорт
	
	Если рарусСостоянияРедактированияОбъектов.ЕстьПравоОтправкиНаБерег() тогда
		Возврат рарусЗаявкаНаСнабжениеСервер.СтатусСогласованияНаДоработкуКапитаном();
	Иначе
		Возврат рарусЗаявкаНаСнабжениеСервер.СтатусСогласованияНаДоработку();
	КонецЕсли;
	
КонецФункции	

Функция ПредставлениеСтатусаСогласованияЧерновик() Экспорт
	
	Возврат "Черновик";

КонецФункции

Функция ПредставлениеСтатусаСогласованияНаДоработке()
	
	Возврат "На доработке";

КонецФункции

Функция ПредставлениеСтатусаСогласованияНаСогласованииКапитаном()
	
	Возврат "На рассмотрении капитаном";

КонецФункции

Функция ПредставлениеСтатусСогласованияНаДоработкуКапитаном()
	
	Возврат "На доработке у капитана";

КонецФункции

Функция ПредставлениеСтатусаСогласованияСогласована(Объект)
	
	Если рарусСостоянияРедактированияОбъектов.ОбъектДоступенДляРедактирования(Объект.Ссылка, Истина) тогда
		Возврат "Зарегистрировано к обмену в береговой модуль";
	Иначе
		Возврат "Отправлено в береговые службы";
	КонецЕсли;
	
КонецФункции

Функция ПредставлениеСтатусСогласованияСозданаНаБерегу()
	
	Возврат "Создана береговыми службами";

КонецФункции

Функция ЭтоРедактированиеНаСудне(Ссылка) Экспорт
	
	ОбластьРедактированияОбъекта = ПолучитьОбластьРедактирования(Ссылка);
	
	ОбластьРедактированияНаСудне = ОбластьРедактированияНаСудне();
	
	Возврат ОбластьРедактированияОбъекта = ОбластьРедактированияНаСудне;
	
КонецФункции

Функция ЭтоРедактированиеНаБерегу(Ссылка) Экспорт
	
	ОбластьРедактированияОбъекта = ПолучитьОбластьРедактирования(Ссылка);
	
	ОбластьРедактированияНаБерегу = ОбластьРедактированияНаБерегу();
	
	Возврат ОбластьРедактированияОбъекта = ОбластьРедактированияНаБерегу;
	
КонецФункции

Функция ЕстьПравоРедактированияПоСтатусу(Ссылка) Экспорт
	
	ТекущийСтатус = ТекущийСтатусСогласования(Ссылка);
	ЕстьПравоОтправкиНаБерег = рарусСостоянияРедактированияОбъектов.ЕстьПравоОтправкиНаБерег();
	
	ЕстьПравоРедактирования = Ложь;
	
	Если ТекущийСтатус = СтатусСогласованияСозданаНаБерегу() тогда
		
		ЕстьПравоРедактирования = Ложь;
		
	ИначеЕсли ТекущийСтатус = СтатусСогласованияНачальный() тогда
		
		ЕстьПравоРедактирования = Истина;
		
	ИначеЕсли ТекущийСтатус = СтатусСогласованияНаДоработку() Тогда 
		
		ЕстьПравоРедактирования = Истина;
		
	ИначеЕсли ТекущийСтатус = СтатусСогласованияНаСогласованииКапитаном()
		И ЕстьПравоОтправкиНаБерег Тогда 
		
		ЕстьПравоРедактирования = Истина;
		
	ИначеЕсли ТекущийСтатус = СтатусСогласованияНаДоработкуКапитаном() 
		И ЕстьПравоОтправкиНаБерег Тогда 	
		
		ЕстьПравоРедактирования = Истина;
		
	ИначеЕсли ТекущийСтатус = СтатусСогласованияСогласована() 
		И ЕстьПравоОтправкиНаБерег Тогда 	
		
		ЕстьПравоРедактирования = Истина;	
		
	КонецЕсли;
	
	Возврат ЕстьПравоРедактирования;
	
КонецФункции

Функция ТекущийСтатусСогласования(Ссылка) Экспорт
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "СтатусСогласования");

КонецФункции

Функция ПолучитьОбластьРедактирования(Ссылка)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ОбластьРедактирования");
	
КонецФункции

Функция ОбластьРедактированияНаСудне() Экспорт
	
	Возврат Перечисления.рарусОбластиРедактирования.Судно;
	
КонецФункции

Функция ОбластьРедактированияНаБерегу() Экспорт
	
	Возврат Перечисления.рарусОбластиРедактирования.Берег;
	
КонецФункции

Функция ВидПотребностиТМЦ() Экспорт
	
	Возврат Перечисления.рарусВидыПотребностиЗаявкиНаСнабжение.ТМЦ;
			
КонецФункции

Функция ВидПотребностиУслуги() Экспорт
	
	Возврат Перечисления.рарусВидыПотребностиЗаявкиНаСнабжение.Услуги;
			
КонецФункции

Функция ВидПотребностиТМЦЗаСчетСобственныхСредств() Экспорт
	
	Возврат Перечисления.рарусВидыПотребностиЗаявкиНаСнабжение.ТМЦЗаСчетСобственныхСредств;
			
КонецФункции

// ++ rarus atyutyakin 21.01.2021  [ФТ.ИМ.02.01]
Функция ВидПотребностиПродуктыПитания() Экспорт
	
	Возврат Перечисления.рарусВидыПотребностиЗаявкиНаСнабжение.ПродуктыПитания;
			
КонецФункции // -- rarus atyutyakin 21.01.2021

// ++ rarus atyutyakin 21.01.2021  [ФТ.ИМ.02.01]
Функция ВидПотребностиНавигационныеКарты() Экспорт
	
	Возврат Перечисления.рарусВидыПотребностиЗаявкиНаСнабжение.НавигационныеКарты;
			
КонецФункции // -- rarus atyutyakin 21.01.2021
	
Функция ОписаниеДополнительныхРеквизитовНоменклатуры(Номенклатура) Экспорт

	Если Не ЗначениеЗаполнено(Номенклатура) тогда
		Возврат "";
	КонецЕсли;
	
	СоотвествтиеНоменклатураСтрока = Справочники.Номенклатура.ДополнительныеРеквизитыСтрокой(Номенклатура);
	
	СтрокаПредставления = СоотвествтиеНоменклатураСтрока[Номенклатура];
	
	Возврат ?(ЗначениеЗаполнено(СтрокаПредставления), СтрокаПредставления, "");

КонецФункции 

Функция НайтиПриходТМЦПоЗаявке(Заявка) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Если ЗначениеЗаполнено(Заявка) тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Заявка", Заявка);
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	впПриходТМЦТМЦ.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.впПриходТМЦ.ТМЦ КАК впПриходТМЦТМЦ
		|ГДЕ
		|	впПриходТМЦТМЦ.Заявка = &Заявка
		|	И НЕ впПриходТМЦТМЦ.Ссылка.ПометкаУдаления";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Документы.впПриходТМЦ.ПустаяСсылка();

КонецФункции 

Функция НайтиПриходыТМЦПоЗаявке(Заявка) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Если ЗначениеЗаполнено(Заявка) тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Заявка", Заявка);
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	впПриходТМЦТМЦ.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.впПриходТМЦ.ТМЦ КАК впПриходТМЦТМЦ
		|ГДЕ
		|	впПриходТМЦТМЦ.Заявка = &Заявка
		|	И НЕ впПриходТМЦТМЦ.Ссылка.ПометкаУдаления";
		
		СписокПриходов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
		Если СписокПриходов.Количество() тогда
			Возврат СписокПриходов;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Новый Массив;

КонецФункции

Функция ЕстьПриходТМЦПоЗаявке(Заявка) Экспорт 

	Возврат ЗначениеЗаполнено(НайтиПриходТМЦПоЗаявке(Заявка));

КонецФункции 
 
////////////////////////////////////////////////////////////////////////////////
//
// Функция 
//
// Описание: 
//	Формирует представление дополнительных реквизитов для списка номенклатуры
//
// Параметры:
//   Номенклатура - Массив, СправочникСсылка.Номенклатура - объекты по которым необходимо построить представление.
//
// Возвращаемое значение: Соответствие
//
Функция ОписаниеДополнительныхРеквизитовПоСпикуНоменклатуры(Номенклатура) Экспорт
			
	Возврат Справочники.Номенклатура.ДополнительныеРеквизитыСтрокой(Номенклатура);
	
КонецФункции

Процедура УстановитьОбластьСозданияДляНовогоОбъекта(Источник) Экспорт

	Если Не Источник.ЭтоНовый() тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Источник.ОбластьСоздания) тогда
		Возврат;
	КонецЕсли;	
	
	УстановитьОбластьСоздания(Источник);	

КонецПроцедуры

Процедура УстановитьОбластьСоздания(Источник)

	ПропуститьУстановитьОбластьСоздания = Неопределено;
	Если Источник.ДополнительныеСвойства.Свойство("ПропуститьУстановитьОбластьСоздания", ПропуститьУстановитьОбластьСоздания) тогда
		Если ПропуститьУстановитьОбластьСоздания = Истина тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Источник.ОбластьСоздания = ОбластьРедактированияНаСудне();

КонецПроцедуры

// ++ rarus atyutyakin 18.02.2021  [ФТ.ИМ.02.01]
Функция ДобавитьКомандуСоздатьПриходТМЦНаОснованииЗаявкаНаСнабжение(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.впПриходТМЦ) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.впПриходТМЦ.ПолноеИмя();
		КомандаСоздатьНаОсновании.Обработчик = "рарусИмущественныйУчетКлиент.СоздатьПриходТМЦНаОснованииЗаявкаНаСнабжение";
		КомандаСоздатьНаОсновании.Представление = ОбщегоНазначения.ПредставлениеОбъекта(Метаданные.Документы.впПриходТМЦ);
		КомандаСоздатьНаОсновании.РежимЗаписи = "Записывать";
		КомандаСоздатьНаОсновании.ФункциональныеОпции = "рарусИспользоватьИмущественныйУчет";
		
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции // -- rarus atyutyakin 18.02.2021
